# 1. Пересмотреть отношение к доменным моделям.
#
# В текущем виде api-модуль некоего сервиса compute устроен следующим образом:
# Слой контроллеров + Фреймворк (FastAPI - DI, Middleware и тд), оркестрирующие
# юзкейсы, оркестрируемые элементы кода - драйверы, кэш, репозитории для работы с БД.

# При этом типы данных, возвращаемые репозиториями - это те же самые доменные модели, которые потом
# возвращают юзкейсы. Пример - репозиторий делает обращение к БД, получает реляции, строит из них доменные модели
# и передает в оркестрирующий слой. В базовом случае юзкейс делает некоторое количество доп. операций, а потом
# возвращает интактную структуру из БД.

# Однако из-за особенностей архитектуры ряд полей, который нужен пользователю, является вычисляемым.
# Как следствие, пользоваться 1-1 моделью от репозитория не выйдет, нужно или добавлять необязательные поля (чего бы
# не хотелось), или расширять возвращаемое оркестратором значение до кортежа (который потенциально раздувается до
# неопределенного размера).
# То есть, по сути, получилось искусственное попадание в ловушку ОРМ-фреймворка.
# Здесь, на мой взгляд, логично разделить классы для передачи данных между репо и сервисами и классы для
# формирования выходных данных для контроллера. Потому что в ситуации с nullable полями мы допускаем
# что None это не допустимое состояние системы, а некое промежуточное состояние, которого как бы быть не должно. Но
# мы надеемся, что ничего на полпути не случится.

# Пожалуй, стоит сказать, что мое решение мне кажется не оптимальным, хоть и лучше, чем текущее.

#  2. Избавиться от дублирования пути выбора целевого хоста при форсированных миграциях и эвакуациях.

# Данное исправление я уже протолкнул в продуктовую среду.
# Ситуация:
# В общем монолите (условно поделенном на модули) есть подсистема, отвечающая за выбор целевого хоста - Scheduler.
# Также есть подсистема, отвечающая за координацию - Conductor. В ситуациях, когда миграция/эвакуация заявляется
# с флагом --force [target host], то есть с принудительным выбором цели, Conductor делает прямое обращение к ресурсу
# для его выделения/подготовки - в обход Scheduler.

# Такое дублирование порождало некоторое количество проблем с поддержкой и внесением изменений, приходилось надеяться,
#  что разработчик знает и помнит про такое ветвление.

# После исправления ветвление было перенесено в scheduler, где отрабатывает основная бизнес логика, а scheduler
# только заявляет миграцию/эвакуацию как форсированную.
# Здесь, на мой взгляд, все достаточно понятно и однозначно (и это приятно).