# Посмотрел в репозиториях, очевидных кандидатов на денормализацию не нашел.
# Есть два неочевидных.
# 1. Перенос метаданных об агрегатах в общую структуру.
# Это делается для редукции повторяющейся работы при сборе данных и создания цельного снапшота для проверки
# на один запрос. Но.
# Это все таки не совсем денормализация в классическом виде (с созданием таблицы) - скорее, частный случай кэширования.
# Однако, в некотором смысле - в смысле создания избыточного промежуточного объекта, аггрегирующего данные - можно
# условно назвать вышеописанное действие денормализацией.
# Из минусов - затраты по памяти и возня с TTL, а также отсутствие привязки к конкретному агрегату.
# Весьма узкий спектр применений, но для примера, на мой взгляд, может подойти.
# 2. Хранение истории перемещений виртуальной машины в отдельной таблице.
# Это, на самом деле, нужно для конкретной задачи - для устранения утечек аллокаций.
# И здесь необходимость в денормализации острая - нужно хранить историю, чтобы четко понимать, есть ли для конкретной
# ВМ у нас право чистить аллоцированные ресурсы (т.е. аллоцированы ли они ошибочно).
# Минусы - затраты по месту на диске и проблемы с чисткой данных.
# Оба варианта привносят некоторое количество проблем, однако у второго польза ощутимая (экономия места на жестких
# дисках, которого резко стало мало).

# Рефлексия.

# Пришлось перечитывать текст несколько раз с перерывами. Честно говоря, на данный момент это самый сложный для
# понимания и усвоения материал из СИ.
# Я выделил два основных (на мой взгляд) направления рассуждения в нем.
# Про мутабельные и иммутабельные объекты.
# Я как-то раньше не задумывался о том, что вообще-то
# все объекты в БД, у которых мы можем менять поля - мутабельны. Почему-то (и это, разумеется, неверно)
# для меня мутабельность/иммутабельность представлялась концепцией, применимой исключительно к слою приложения.
# Однако сейчас, задумываясь о тексте, я понял, что различия гораздо глубже, в самом подходе к рассуждению
# о данных и их взаимодействиях. И пусть в отношении кода лично я стараюсь мутабельности избегать везде, где возможно,
# из примерно тех же соображений, которые описаны в тексте, это не имеет прямого отношения о структуре системы
# на высоком уровне абстракции. Хотя было бы странным предполагать, что на уровне взаимодействия, например, АТД,
# подобные теоретические выкладки должны работать как-то по-другому - в конце концов, мы говорим о математической
# теории, то есть о теории поведения абстрактных объектов.
# И на таком высокоабстрактном уровне имеет смысл пусть и не стремиться к безусловному отказу от мутабельности,
# но как минимум держать в голове, что она чревата последствиями и должна держаться в рамках необходимого минимума.
# Речь, конечно, не идет о том, как все работает "под капотом", где все подчинено производительности.
# И это еще один вызов - связать подобные абстрактные взаимодействия с конкретикой.
# Возможно, я что-то понял не так, скорее всего, мое мнение изменится в дальнейшем, но промежуточные выводы такие.
# Про денормализацию.
# Здесь тоже достаточно интересно. С одной стороны, пример из текста показывает, как можно решить проблему
# хранения и взаимодействия двух очень разных сущностей. С другой, лично мне после прочтения все еще трудно представить,
# как можно объединить два настолько разных и явно имеющих большое количество зависимых структур объекта в
# некий один, общий. Да еще и иммутабельный. Сразу рука чешется надобавлять ссылок по ID от одного к другому.
# И в какой-то момент я понял (надеюсь правильно) - суть ведь не в том, как именно хранятся объекты.
# Суть в том, что мы даем прямые ссылки на одни объекты в самой структуре данных другого.
# И таким образом их связываем не на уровне бизнес-логики, которая ими оперирует, я прямо самой их структуре.
# Ранее в практике видел подобные примеры, но никогда о них не задумывался. Они воспринимались как что-то
# естественное и обычное, а ведь это не так. Более того, это не очень хорошо, потому что неосознанное введение
# подобных вещей в проект потенциально ведет к хаосу. Спасибо.

